alert(`Приветсвую вас, землянин,` + ` рад представить тебе демо-версию нашего калькулятора`)

alert(`Для начала посчитаем сумму`)
let a = Number(prompt(`Введите первое число:`)) 
let b = Number(prompt(`Укажите второе число:`))
alert(a+b)

alert(`Продолжим закомится с математическими действиями`)
alert(`Предлагаю посчтитать разницу`)
let d = Number(prompt(`Введите первое число:`)) 
let e = Number(prompt(`Укажите второе число:`))
alert(d-e)

alert(`Посчитаем произведение`)
let f = Number(prompt(`Введите первое число:`)) 
let g = Number(prompt(`Укажите второе число:`))
alert(f*g)

alert(`Переходим к частному`)
let i = Number(prompt(`Введите первое число:`)) 
let j = Number(prompt(`Укажите второе число:`))
alert(i/j)

alert(`Наш калькулятор может даже в степень возводить`)
let k = Number(prompt(`Введите возведимое число`))
let l = Number(prompt(`Укажите степень, в которую нужно возвести`))
alert(k**l)

alert(`Полную версию вы сможете найти по сылке: https://calculator888.ru/` + `, купив подсписку всего за 5$`)

let m = `Привет я хочу изучать js,` + `после изучения которого, я буду крутым программистом`
alert(m)